Tekla Open API Reference for Tekla Structures 2025
IGeometryNodeVisitor Interface
 The IGeometryNodeVisitor interface is implemented by classes visiting geometry nodes
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IGeometryNodeVisitor
Public Interface IGeometryNodeVisitor
Methods
Name | Description
Visit(SpiralNode)
 Visits a node that is an instance of HelixNode
Visit(CylindricalSurfaceNode)
 Visits a node that is an instance of CylindricalSurfaceNode
Visit(PolygonNode)
 Visits a node that is an instance of PolygonNode node
Top
See Also
Reference
Tekla.Structures.Model Namespace